// 艺术片
var art = [
    {
        id: 1291549,
        alt: "https://movie.douban.com/subject/1291549/",
        year: 2004,
        title: "放牛班的春天",
        rating: 9.2,
        original_title: "Les choristes",
        directors: "克里斯托夫·巴拉蒂",
        casts: "热拉尔·朱尼奥,让-巴蒂斯特·莫尼耶,弗朗索瓦·贝莱昂",
        genres: "剧情,音乐",
        image: "https://img3.doubanio.com/view/movie_poster_cover/spst/public/p1910824951.jpg",
        synopsis: "1949年的法国乡村，音乐家克莱门特（杰勒德•尊诺 饰）到了一间外号叫“塘低”的男子寄宿学校当助理教师。学校里的学生大部分都是难缠的问题儿童，体罚在这里司空见惯，学校的校长（弗朗西斯•贝尔兰德 饰）只顾自己的前途，残暴高压。性格沉静的克莱门特尝试用自己的方法改善这种状况，他重新创作音乐作品，组织合唱团，决定用音乐的方法来打开学生们封闭的心灵。然而，事情并不顺利，克莱门特发现学生皮埃尔•莫安琦（尚•巴堤•莫里耶 饰）拥有非同一般的音乐天赋，但是单亲家庭长大的他，性格异常敏感孤僻，怎样释放皮埃尔的音乐才能，让克莱门特头痛不已；同时，他与皮埃尔母亲的感情也渐渐微妙起来。",
        comment1: "<strong>大头绿豆</strong>：体育和音乐是促进国家团结的要素。可是俺都不会哈哈。",
        comment2: "<strong>寂地</strong>：还有漂亮的小正太们哟,很棒的电影,我在电影院看的。"
    },
    {
        id: 1292001,
        alt: "https://movie.douban.com/subject/1292001/",
        year: 1998,
        title: "海上钢琴师",
        rating: 9.2,
        original_title: "La leggenda del pianista sull'oceano",
        directors: "朱塞佩·托纳多雷",
        casts: "蒂姆·罗斯,普路特·泰勒·文斯,比尔·努恩",
        genres: "剧情,音乐",
        image: "https://stormxing.oss-cn-beijing.aliyuncs.com/images/piano.png",
        synopsis: "本片讲述了一个钢琴天才传奇的一生。1900年，Virginian号豪华邮轮上，一个孤儿被遗弃在头等舱，由船上的水手抚养长大，取名1900（蒂姆•罗斯 饰）。1900慢慢长大，显示出了无师自通的非凡钢琴天赋，在船上的乐队表演钢琴，每个听过他演奏的人，都被深深打动。爵士 乐鼻祖杰尼听说了1900的高超技艺，专门上船和他比赛，最后自叹弗如，黯然离去。可惜，这一切的事情都发生在海上，1900从来不愿踏上陆地，直到有一天，他爱上了一个女孩，情愫在琴键上流淌。他会不会为了爱情，踏上陆地开始新的生活，用他的琴声惊艳世界？他将怎样谱写自己非凡的人生。",
        comment1: "<strong>Soblue</strong>：我总觉得这是一个真实的故事，因为他的懦弱，懦弱得真实。",
        comment2: "<strong>沐风而遇周星星</strong>：你看到那数不清的街道吗？如何只选择其中一条去走 ，一个共渡一生的女人，一幢属于自己的屋子，一种生与死的方式。 你甚至不知道什么时候才是尽头 ，一想到这个，难道不会害怕、会崩溃吗 ？"
    },
    {
        id: 1292218,
        alt: "https://movie.douban.com/subject/1292218/",
        year: 1998,
        title: "中央车站",
        rating: 8.7,
        original_title: "Central do Brasil",
        directors: "沃尔特·塞勒斯",
        casts: "费尔兰德·蒙特纳哥,马里利娅·佩拉,文尼西斯·狄·奥利维拉",
        genres: "剧情,音乐",
        image: "https://img3.doubanio.com/view/movie_poster_cover/spst/public/p2239441575.jpg",
        synopsis: "里约热内卢的中央车站，朵拉（费尔南达-蒙特内格罗Fernanda Montenegro饰）在这里帮人写信。但她会把看不顺眼的信统统撕掉不寄，甚至公开读信里的内容取乐。朵拉生活拮据，年纪不小却还未嫁，或许在她内心，人与人之间的真情根本就不值得信赖。小男孩约书亚（文尼西斯•狄•奥利维拉Vinícius de Oliveira 饰）的出现令她开始了一段重新认识人生的旅程——约书亚很想见到远方素未谋面的父亲，不断写信给他。男孩母亲意外的车祸让朵拉决定陪伴约书亚前往东北部寻找父亲。在约书亚眼中，即使父亲很陌生，却总是骄傲地谈起父亲。而朵拉，也同样有着一段和父亲的痛苦往事。在约书亚寻父的过程中，朵拉因为往事而冰冻的内心慢慢回暖。",
        comment1: "<strong>狷介有乌青</strong>：我想导演想追寻的并不是主人公小男孩未曾谋面的父亲，也不是老女人消逝的对生活的激情。在那个困顿迷茫的年代，中央车站，是整个巴西的缩影吧，我想影片想唤起的应该是国家的振兴。",
        comment2: "<strong>理想多钱一斤</strong>:什么时代我们总是还需要这样的导演和这样的电影，因为他们告诉我们不管眼前多么漆黑一片前面总有什么值得期待"
    },
    {
        id: 1292224,
        alt: "https://movie.douban.com/subject/1292224/",
        year: 1975,
        title: "飞越疯人院",
        rating: 9,
        original_title: "One Flew Over the Cuckoo's Nest",
        directors: "米洛斯·福尔曼",
        casts: "杰克·尼科尔森,丹尼·德维托,克里斯托弗·洛伊德",
        genres: "剧情,音乐",
        image: "https://img1.doubanio.com/view/movie_poster_cover/spst/public/p792238287.jpg",
        synopsis: "麦克墨菲（杰克·尼科尔森 Jack Nicholson 饰）为了逃避监狱里的强制劳动，装作精神异常，被送进了精神病院，他的到来，给死气沉沉的精神病院带来了剧烈的冲击。麦克要求看棒球比赛的电视转播，挑战了医院严格的管理制度，受到护士长瑞秋（路易丝·弗莱彻 Louise Fletcher 饰）的百般阻挠；麦克带领病人出海捕鱼，振奋了 他们的精神，却让院方头痛不已。院方为了惩处麦克胆大妄为、屡犯院规，决定将他永远留在疯人院。生性自由的麦克再也无法忍受疯人院的生活，他联合病友，高大的印第安人“酋长”，开始自己的计划：飞越疯人院。本片获1975年第48届奥斯卡最佳影片，最佳男、女主角，最佳导演和最佳改编剧本五项大奖。主人公“不自由毋宁死”的精神在当今社会仍有很大的现实意义。",
        comment1: "<strong>城南草木生</strong>：无论是现在还是在将来，疯人院和护士长化妆成各种形状潜伏在我们周围，飞越疯人院就永远有意义",
        comment2: "<strong>锡罐头</strong>：R.P.McMurphy对体制的挑战以脑叶被切除告终，他对自由的追求失败了吗？他所有的尝试都改变了——哪怕一丁点——“疯子们”的生活环境和心灵禁锢。关于受到争议的死亡，则是酋长对完整人格的高度尊重，代表另一个层面的自由。"

    },
    {
        id: 1292262,
        alt: "https://movie.douban.com/subject/1292262/",
        year: 1984,
        title: "美国往事",
        rating: 9.1,
        original_title: "Once Upon a Time in America",
        directors: "赛尔乔·莱翁内",
        casts: "罗伯特·德尼罗,詹姆斯·伍兹,伊丽莎白·麦戈文",
        genres: "剧情,音乐",
        image: "https://img1.doubanio.com/view/movie_poster_cover/spst/public/p477229647.jpg",
        synopsis: "二十年代的美国，纽约少年“面条”（罗伯特•德尼罗 饰）和几个同龄朋友一起认识了聪明狡黠的“麦大”（詹姆斯 • 伍兹 饰），他们开始从事走私活动。不久，面条在一场械斗中杀伤人命，被关进监牢。若干年后，“面条”出狱，当时的小伙伴们已经变成了健壮的青年人，在“麦大”的带领下，他们开始了一系列抢劫、盗窃、敲诈活动。随着犯罪活动的不断深入，“麦大”似乎被胜利冲昏了头脑，竟然把美国联邦储备银行也列入了行动目标。“面条”不忍眼看好友走向毁灭，偷偷打电话报警，想逼迫“麦大”收手。警察与“面条”的朋友展开激烈枪战，“麦大”等人全部被杀。“面条”带着深深的悔恨和痛苦，离开纽约，回到年少时生长的地方。三十五年过去了，几近垂暮的“面条”重新回到纽约的伤心地，他遇见了少时的朋友和旧情人，而当年“麦大”他们的死，背后竟然包含着出乎意料的阴谋。",
        comment1: "<strong>王大根</strong>：两场强暴戏毕竟是吃不消，男性的传奇之路上似乎最少不得的就是美丽而无人格的女性牺牲品",
        comment2: "<strong>Q</strong>:以前看的时候并不能完全理解这部电影，电影里太多的内容让自己并不能一下子就可以消化得了。重看这部近四个小时的电影，没有觉得半点枯燥沉闷，好似在翻阅一本浑厚的小说，一生中所有最重要的东西都在里面，值得慢慢回味……"

    },
    {
        id: 1787291,
        alt: "https://movie.douban.com/subject/1787291/",
        year: 2006,
        title: "被嫌弃的松子的一生",
        rating: 8.9,
        original_title: "嫌われ松子の一生",
        directors: "中岛哲也	",
        casts: "中谷美纪,瑛太,香川照之",
        genres: "剧情,歌舞",
        image: "https://img1.doubanio.com/view/movie_poster_cover/spst/public/p453723669.jpg",
        synopsis: "有一天父亲（香川照之饰）突然来找阿笙（瑛太饰），告诉他有个素未谋面的姑姑死了，叫他去收拾下姑姑的房子。在河边的破烂小屋里，阿笙渐渐开始了解父亲口中的姑姑，到底有着怎样的一生。小时候的姑姑川尻松子（中谷美纪饰）经常做着白雪公主似的美梦，她后来成为一名安分的中学教师，却因百口莫辩的误会被辞退了，之后和一作家同居，作家却因为太爱她而选择自杀，死前留下遗言：生而为人对不起。这件事对松子打击极大；之后与该作家的事业敌人同居直至，又忍受不住去找对方妻子的诱惑，结果惨遭抛弃；又是当上浴室女郎，甚至还杀人入狱，然而不管有意无意，她从不放弃生活的希望。不管生活再怎样破碎，她仍然本能地生存下去，这生存本身，足以打动任何人，包括阿笙。",
        comment1: "<strong>半袖</strong>：松子的生命力真顽强，每次说着“我觉得人生完了”，但是又都站了起来，当然，那时候她多么年轻，还有时间，还有爱。可惜正常的人生还是可望不可及，无非想被爱和爱人，但是不止寡情会辜负人，浓情同样也会。她总是在忍受，即便挨打，也还是要坚持在一起，留着希望，也许这也是一种方式的被重视吧，聊胜于无。是呀，为了被重视，她不断的去讨好别人，用鬼脸、用身体、用爱，但是那雪地上的一击，任谁都会被打垮吧，所以她不再反抗了，对人生逆来顺受，没有人可以相信，善良终于被挥霍完毕了。",
        comment2: "<strong>小耳朵图吗</strong>：生而为人，对不起。"

    },
    {
        id: 2053515,
        alt: "https://movie.douban.com/subject/2053515/",
        year: 2006,
        title: "曾经",
        rating: 8.3,
        original_title: "Once",
        directors: "约翰·卡尼	",
        casts: "格伦·汉塞德,玛可塔·伊尔格洛娃,Alaistair Foley",
        genres: "剧情,音乐,爱情	",
        image: "https://img3.doubanio.com/view/movie_poster_cover/spst/public/p2173720203.jpg",
        synopsis: "这是一部由音乐开启的爱尔兰电影。　卖花女（Marketa Irglova）被街头艺人（Glen Hansard饰）的音乐所吸引，开始了一段荡气回肠的浪漫故事。他们不是王子和公主，各自有着琐碎的生活，但是他们有个共同点，那就是对音乐的热爱。在一次合奏中，他们找到了彼此间惊人的默契。这个发现让他们兴奋，很快他们找到了另外的一个同伴，组成了一个乐队，并通过优秀的表现得到了专业人士的肯定。与此同时，爱情也在逐渐萌芽。音乐是这部电影最大的亮点之一，塑造了极其浪漫唯美的氛围。",
        comment1: "<strong>影志</strong>：曾经拥有的，不要忘记。不能得到的，更要珍惜。属于自己的，不要放弃。已经失去的，留作回忆。How ofen do you find a right person? ——导演用尽全力去还原生活的平庸，然后让我们发现其中微弱却真实的梦想……",
        comment2: "<strong>芝麻酱</strong>：看的我泪光闪闪阿。。。倒不是因为剧情。。。歌很打动人心阿。。"
    },
    {
        id: 2149806,
        alt: "https://movie.douban.com/subject/2149806/",
        year: 2008,
        title: "入殓师",
        rating: 8.8,
        original_title: "おくりびと",
        directors: "泷田洋二郎",
        casts: "本木雅弘,广末凉子,山崎努",
        genres: "剧情",
        image: "https://img1.doubanio.com/view/movie_poster_cover/spst/public/p594972928.jpg",
        synopsis: "买了昂贵的大提琴，想要成就一番事业的小林大悟（本木雅弘 饰），经历了4个月的管弦乐演奏，得到的却是“乐团解散”的噩耗与购买乐器的高昂债务。迫不得已，大悟与妻子美香（广末凉子 饰）搬到老屋，过着清贫的日子。某日，一则广告吸引了大悟的注意：NK代理公司，帮助旅行，高薪短工时。大悟来到NK代理公司面试，社长佐佐木生荣（山崎努 饰）二话不说就决定聘用大悟，但却对工作内容避而不谈。在大悟的再三追问下，佐佐木社长终于道明：是入殓（日语Nou Kan）工作！虽然心理上有所忌惮，高额的薪水还是令大悟接受了这份工作。但这样的工作对普通人谈何容易，一方面对遗体的不适，一方面又要对妻友隐瞒自己的工作，小林大悟不平凡的工作就这样开始了。",
        comment1: "<strong>影志</strong>：The gift of the last memories. “人一辈子买的最后一样东西(棺材)是由他人决定的。”“死可能是一道门，逝去并不是终结，而是超越，走向下一程。”“入殓师就是让已经冰冷的人重新焕发生机，给她永恒的美丽，这要有冷静、准确、而且要怀着温柔的情感。”《入殓师》的中国遭遇：“它的国际首映在大连",
        comment2: "<strong>恶魔的步调</strong>：很简单的故事但确实是感人。关于死亡的仪式。自己关于死亡的三个记忆：去年年底以及今年上半年各参加了一个葬礼；高中一个同学在高考前因癌症去逝了；初中一个同学则在殡仪馆就职。"
    }
];

art = JSON.stringify(art);

localStorage.setItem("art", art);