''// 奇幻/科幻片
var fantasy = [
    {
        id: 1291545,
        alt: "https://movie.douban.com/subject/1291545/",
        year: 2003,
        title: "大鱼",
        rating: 8.7,
        original_title: "Big Fish",
        directors: "蒂姆·波顿",
        casts: "伊万·麦克格雷格,阿尔伯特·芬尼,比利·克鲁德普",
        genres: "剧情,家庭,奇幻",
        image: "https://img3.doubanio.com/view/movie_poster_cover/spst/public/p692813374.jpg",
        synopsis:"爱德华（伊万·麦克格雷格 Ewan McGregor 饰）生性热爱自由，成年之后，他选择离开家乡，踏上了环游世界的旅程。一路上，爱德华遇见了各种各样稀奇古怪的角色，经历了无数精彩绝伦的的冒险，而他日后最大的兴趣，就是向他人喋喋不休的重复讲述他的这一段奇幻旅程。威尔（比利·克鲁德普 Billy Crudup 饰）是爱德华的儿子，他并不相信父亲所讲述的那些光怪陆离的故事，甚至对此感到无比厌烦。婚后，他同父亲中断了联系，一晃眼就是数年过去。当再次得到爱德华的消息之时，威尔才知道父亲即将不久于人世，他决定去见爱德华最后一面。然而，这一次，威尔终于发现了隐藏在这些故事背后的奥秘和真相。",
        comment1:"<strong>Q。</strong>：“他最终自己也成为了故事；并且，成为了不朽。”口吻轻松，内容深沉，虽是天马行空般的描述，却能很真实而又极其简单得触动人心，尤其是最后那首《Man Of The Hour》响起，难以言喻的难过。只可惜，父爱这个词，这辈子我都没感受过。",
        comment2:"<strong>Doublebitch</strong>：似幻似真，此时没有真实或者不真实，只有你愿不愿意相信。 "
    },
    {
        id: 1291552,
        alt: "https://movie.douban.com/subject/1291552/",
        year: 2003,
        title: "指环王3：王者无敌",
        rating: 9.1,
        original_title: "The Lord of the Rings: The Return of the King",
        directors: "彼得·杰克逊",
        casts: "维果·莫腾森,伊利亚·伍德,西恩·奥斯汀",
        genres: "剧情,动作,奇幻",
        image: "https://img3.doubanio.com/view/movie_poster_cover/spst/public/p1910825503.jpg",
        synopsis:"魔幻战争逐渐进入高潮阶段。霍比特人弗拉多（伊利亚·伍德 Elijah Wood 饰）携带着魔戒，与伙伴山姆（Sean Astin 饰）以及狡猾阴暗的咕噜等前往末日山，一路上艰难险阻不断，魔君索伦为阻止魔戒被销毁用尽全力阻挠。另一方面，白袍巫师甘道夫（伊安·麦克莱恩 Ian McKellen 饰）率中土勇士们镇守刚铎首都——白城米那斯提里斯。魔兽大军压境，黑暗与光明的决战即将来临……本片是“指环王三部曲”的终结篇，根据英国作家J.R.R.托尔金（J.R.R. Tolkien）同名魔幻巨著《指环王》（The Lord of the Rings）改编，并荣获2004年第76届奥斯卡最佳影片、最佳导演、最佳改编剧本、最佳剪辑、最佳艺术指导、最佳服装设计、最佳化妆、最佳视觉效果、最佳音效、最佳配乐和最佳歌曲等11项大奖。",
        comment1:"<strong>颜良辰</strong>：每次看魔戒都会被奥兰度惊艳到~ ",
        comment2:"<strong>A_sun</strong>：亡灵奔涌那里很帅••••••"
    },
    {
        id: 1291571,
        alt: "https://movie.douban.com/subject/1291571/",
        year: 2001,
        title: "指环王1：魔戒再现",
        rating: 8.9,
        original_title: "The Lord of the Rings: The Fellowship of the Ring",
        directors: "彼得·杰克逊",
        casts: "伊利亚·伍德,西恩·奥斯汀,伊恩·麦克莱恩",
        genres: "剧情,动作,奇幻",
        image: "https://img3.doubanio.com/view/movie_poster_cover/spst/public/p1354436051.jpg",
        synopsis:"比尔博•巴金斯是100多岁的哈比人，住在故乡夏尔，生性喜欢冒险，在年轻时的一次探险经历中，他从怪物咕噜手中得到了至尊魔戒，这枚戒指是黑暗魔君索伦打造的至尊魔戒，拥有奴役世界的邪恶力量，能够统领其他几枚力量之戒，在3000年前的人类联盟和半兽人大军的战役中，联盟取得了胜利，并得到了至尊魔戒，数千年的辗转后，魔戒落到咕噜手中，被比尔博碰巧得到。因为和魔戒的朝夕相处，比尔博的心性也受到了影响，在他111岁的生日宴会上，他决定把一切都留给侄子佛罗多(伊莱贾•伍德 饰)，继续冒险。比尔博的好朋友灰袍巫师甘道夫（伊恩•麦凯伦 饰）知道至尊魔戒的秘密，同时，黑暗魔君索伦已经知道他的魔戒落在哈比族的手中。索伦正在重新建造要塞巴拉多，集结无数的半兽人，准备以大军 夺取魔戒，并且征服全世界。甘道夫说服佛罗多将魔戒护送到精灵王国瑞文希尔，佛罗多在好朋友山姆、皮平和梅利的陪同下，在跃马旅店得到了刚铎王子阿拉贡的帮助，历经艰难，终于到达了精灵王国。然而，精灵族并不愿意保管这个邪恶的至尊魔戒，中土各国代表开会讨论，达成意见，准备将至尊魔戒送到末日山脉的烈焰中彻底销毁，佛罗多挺身而出接受了这个任务，这次，陪伴他的除了三个好朋友，还有甘道夫、阿拉贡、精灵莱戈拉斯（奥兰多•布鲁姆 饰）、人类博罗米尔、侏儒金利。一路上，魔戒远征军除了要逃避索伦爪牙黑骑士和半兽人的追杀之外，更要抵抗至尊魔界本身的邪恶诱惑，前途困难重重。",
        comment1:"<strong>束</strong>：一口气看完三部白金加长版，对于这样的片子，只有两个字形容：经典。相对于骇客帝国，这三部的连续性非常好，值得称赞。 ",
        comment2:"<strong>独行狼</strong>：想到魔幻世界,想感受史诗的魅力,那就看它吧"
    },
    {
        id: 1291572,
        alt: "https://movie.douban.com/subject/1291572/",
        year: 2002,
        title: "指环王2：双塔奇兵",
        rating: 8.9,
        original_title: "The Lord of the Rings: The Two Towers",
        directors: "彼得·杰克逊",
        casts: "伊利亚·伍德,西恩·奥斯汀,伊恩·麦克莱恩",
        genres: "剧情,动作,奇幻",
        image: "https://img3.doubanio.com/view/movie_poster_cover/spst/public/p909265336.jpg",
        synopsis:"第二部在延续第一部风格的同时，故事呈现出多线发展的格局，情节有了更高的观赏性。第一部结尾，博罗米尔被强兽人杀死之后，两个哈比族人皮平和梅利也被强兽人绑架，阿拉贡、精灵莱戈拉斯（奥兰多•布鲁姆 饰）、侏儒金利一路追踪强兽人，营救皮平和梅利，遇到了“复活”的白袍巫师甘道夫（伊恩•麦凯伦 饰）。此时，投降索伦的白袍巫师萨鲁曼控制了人类洛汉王国的国王，并派出大量的强兽人军队，准备消灭人类。阿拉贡、莱戈拉斯和金利在甘道夫的带领下，帮助洛汉王国对抗邪恶力量的入侵。幸运的皮平和梅利被会说话的树精救了出来，并且遇到“复活”的甘道夫，在甘道夫的授意下，树精保护了两人的安全，并且带他们参加树精大会，大会上，树精们讨论对待中土大战的态度：是继续当中立者，逆来顺受，还是奋起反抗？身负重任的佛罗多(伊莱贾•伍德 饰)和山姆继续向末日山脉前进，一路上被咕噜跟踪，弗罗多依靠至尊魔戒的力量，成为了咕噜的主人，在咕噜的带领下，他们到了末日山脉的入口，黑门。就在他们准备进入之时，博罗米尔的弟弟法莫尔出现，将他们带回了刚铎。弗罗多又遇上了新的危机：法莫尔想利用至尊魔戒的力量对抗萨鲁曼的攻击……",
        comment1:"<strong>wise🐾喵悠哉</strong>：比第一部有意思，树人开闸放水冲毁艾辛格的时候，其中一个着火的树人赶紧把头伸进水里笑死我了，好萌啊。假如一开始魔戒就被丢到末日火焰哪来这么多战争和死亡，和异形一样，都是人类的贪欲，自作孽。 ",
        comment2:"<strong>错乱天堂</strong>：莱格拉斯无敌帅~ "


    },
    {
        id: 1292370,
        alt: "https://movie.douban.com/subject/1292370/",
        year: 1990,
        title: "剪刀手爱德华",
        rating: 8.7,
        original_title: "Edward Scissorhands",
        directors: "蒂姆·波顿",
        casts: "约翰尼·德普,薇诺娜·瑞德,黛安·韦斯特",
        genres: "剧情,奇幻,爱情",
        image: "https://img1.doubanio.com/view/movie_poster_cover/spst/public/p480956937.jpg",
        synopsis:"爱德华（约翰尼•戴普 饰）是一个机器人，他拥有人的心智，却有一双剪刀手，孤独地生活在古堡里，闯入古堡的化妆品推销员佩格把他带回家，让他走进了人类的世界。单纯的爱德华爱上了佩格的女儿金（薇诺娜•瑞德 饰），金也慢慢的被爱德华的善良所吸引。但是，一连串的意外事情让周围的人邻居对爱德华的态度从喜欢变成无法接受，爱德华痛苦地发现，他总是好心办坏事，连自己的爱人都不能拥抱，或许，他注定就不属于这个世界。",
        comment1:"<strong>凯拉奈特莉</strong>：佩格居住的小镇是画笔般彩色的，这里的人们好奇热情也多疑。爱德华获得明星般的关注，也在人类的世界遭遇讨伐。金对于他，永远只能是剪刀下冰雕的女神像，无法拥抱，无法守护。完美的悲剧童话，如同后来每年的雪。 ",
        comment2:"<strong>老鸡｜扶立</strong>：爱德华的眼睛让人心疼 "
    },
    {
        id: 1295038,
        alt: "https://movie.douban.com/subject/1295038/",
        year: 2001,
        title: "哈利·波特与魔法石",
        rating: 8.6,
        original_title: "Harry Potter and the Sorcerer's Stonee",
        directors: "克里斯·哥伦布",
        casts: "丹尼尔·雷德克里夫,艾玛·沃森,鲁伯特·格林特",
        genres: "奇幻,冒险",
        image: "https://img3.doubanio.com/view/movie_poster_cover/spst/public/p804947166.jpg",
        synopsis:"哈利波特是一个孤儿，从小寄养在姨妈家，受尽欺凌。但就在哈利11岁生日的时候，他意外收到了霍格沃茨学院的入学通知书。哈利从该学院派来接他的巨人海格口中得知，这是一间魔法学院，并得知了自己的身世，原来哈利的父母都是伟大的魔法师，在对付伏地魔的战斗中双双献身，唯有哈利幸免于难。哈利进入霍格沃茨后，表现出了超乎想象的飞行天赋，得到麦格教授的推荐进入了格兰芬多的魁地奇球队。另一方面，哈利发现霍格沃茨学院内有一股黑暗势力似乎在暗暗滋长，揭开谜团的关键就在有凶恶的三头犬守护的房间内。哈利、罗恩和赫敏三个好朋友决定探个究竟。",
        comment1:"<strong>墨语悠然</strong>：这部电影是刚上中学过最后一个六一的时候，学校给放的，太久远的记忆了。作者天马行空的想象力，电影精妙绝伦的现，让我第一次对想象中的“魔法”，有了一个具象的观感。虽然那是一个虚拟的世界，但是我不会忘记那份感动和震撼。九又四分之三站台，分院帽，格兰芬多，魁地奇，都是最精彩的记忆！ ",
        comment2:"<strong>宅蘑菇Moku</strong>：还是第一部最可爱了，正太是正太萝莉是萝莉的 "
    },
    {
        id: 1298070,
        alt: "https://movie.douban.com/subject/1298070/",
        year: 2003,
        title: "加勒比海盗",
        rating: 8.6,
        original_title: "Pirates of the Caribbean: The Curse of the Black Pearl",
        directors: "戈尔·维宾斯基",
        casts: "约翰尼·德普,杰弗里·拉什,奥兰多·布鲁姆",
        genres: "动作,冒险,奇幻",
        image: "https://img3.doubanio.com/view/movie_poster_cover/spst/public/p1596085504.jpg",
        synopsis:"故事发生在17世纪，传说中海盗最为活跃的加勒比海。风趣迷人的杰克·斯伯洛（约翰尼·德普 Johnny Depp 饰），是活跃在加勒比海上的海盗，拥有属于自己的“黑珍珠”号海盗船。对他来说，最惬意的生活就是驾驶着“黑珍珠”号在加勒比海上游荡，自由自在的打劫过往船只。但不幸的是，他的仇敌，老谋深算的巴尔巴罗萨船长(杰弗里·拉什 Geoffrey Rush 饰)偷走了他的“黑珍珠”号。巴伯萨是一个无恶不作的坏蛋，他抢劫了杰克的“黑珍珠号后”，更加猖狂，在加勒比海上横行霸道，一时成为整个加勒比海的霸主。一次，巴伯萨一伙袭击了罗亚尔港小镇，还绑架了总督的女儿伊莉莎白·斯万(凯拉·奈特莉 Keira Knightley 饰)和伊莉莎白青梅竹马的铁匠学徒威尔·特纳（奥兰多·布鲁姆 Orlando Bloom 饰），想方设法救出了狱中的船长杰克，偷来英国皇家舰队最快的“拦截号”军舰迅速向“黑珍珠”追去。在打斗中，威尔和杰克发现，巴尔巴罗萨和他的海盗们身背着咒语，在每一个月光之夜，他们就变成了不死骷髅，而伊莉莎白正是解开咒语的关键。",
        comment1:"<strong>王大根</strong>：小时候觉得好酷的男人，现在只想递给他一块肥皂求他去洗洗头洗洗澡 ",
        comment2:"<strong>孔雀鱼</strong>：放荡不羁的杰克船长，以海为家，以船为马的海盗们，那是属于你们的航海时代，升起骷髅旗，去远航吧！ "
    },
    {
        id: 10577869,
        alt: "https://movie.douban.com/subject/10577869/",
        year: 2013,
        title: "时空恋旅人",
        rating: 8.6,
        original_title: "About Time",
        directors: "理查德·柯蒂斯",
        casts: "多姆纳尔·格里森,瑞秋·麦克亚当斯,比尔·奈伊",
        genres: "剧情,爱情,奇幻",
        image: "https://img3.doubanio.com/view/movie_poster_cover/spst/public/p2070153774.jpg",
        synopsis:"Tim（多姆纳尔·格利森 Domhnall Gleeson 饰）21岁了，他的老爸（比尔·奈伊 Bill Nighy 饰）告诉他，他们家族的男人都有时光旅行的超能力，可以回到过去。于是Tim将信就疑地试了一下，回到了夏天，在那里他试图改变和暗恋对象的关系，却发现怎么穿越时空都不能让不爱你的人爱上你。之后Tim来到了伦敦，成为了一个律师。他爱上了一个漂亮的姑娘Mary（瑞秋·麦克亚当斯 Rachel McAdams 饰），他通过几次时空旅行，努力地想成为Mary的男朋友。再后来，他又试图通过时光旅行，去挽回一场失败的话剧，去改善妹妹的生活，去更好地和亲人、朋友相处，度过生命中的每一天。",
        comment1:"<strong>办公室甜心</strong>：选角美，配乐美，造型美，镜头美，剧情美，台词美，这样一部让人心情好的电影，我都快忘了爱情事件多美的事儿了，可电影不仅仅只描述了爱情，还有温馨的家人，给一百颗星都不够！Rachel这样可人的女孩，要遇到了我一定会去追 ❤",
        comment2:"<strong>白发生</strong>：时空穿梭在片中不过是一味调剂，完全没必要深究所谓的逻辑。生命中发生的一切都有它的意义，总有些事任你如何通天彻地也无能为力。时光总在前行，生活终要继续，纵然历经风雨，只要用心感受仍会发觉其中美丽。每一天都是独一无二的旅程，无需任何修整与调试依然可以走出无与伦比的人生轨迹。"
    }
];

fantasy = JSON.stringify(fantasy);

localStorage.setItem("fantasy", fantasy);